tests/load/insights.yml
config:
  target: "https://your-app.vercel.app"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./tests/load/processor.js"

scenarios:
  - name: "Document Creation"
    flow:
      - post:
          url: "/api/documents"
          json:
            raw_content: "测试文档内容 {{ $randomString() }}"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TOKEN }}"
          capture:
            - json: "$.document.id"
              as: "documentId"
      - think: 1  # 暂停 1 秒

  - name: "AI Analysis"
    flow:
      - post:
          url: "/api/insights"
          json:
            documentId: "{{ $randomString() }}"
            lensType: "requirements"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TOKEN }}"
          capture:
            - json: "$"
              as: "insight"
      - think: 2  # 暂停 2 秒